leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxSrc_reg.h
/** \brief  93C, MULTICAN Service Request */
#define SRC_CAN_CAN0_INT15 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003893Cu)

/** Alias (User Manual Name) for SRC_CAN_CAN0_INT15.
* To use register names with standard convension, please use SRC_CAN_CAN0_INT15.
*/
#define	SRC_CANINT15	(SRC_CAN_CAN0_INT15)

/** \brief  908, MULTICAN Service Request */
#define SRC_CAN_CAN0_INT2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038908u)

/** Alias (User Manual Name) for SRC_CAN_CAN0_INT2.
* To use register names with standard convension, please use SRC_CAN_CAN0_INT2.
*/
#define	SRC_CANINT2	(SRC_CAN_CAN0_INT2)

/** \brief  90C, MULTICAN Service Request */
#define SRC_CAN_CAN0_INT3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003890Cu)

/** Alias (User Manual Name) for SRC_CAN_CAN0_INT3.
* To use register names with standard convension, please use SRC_CAN_CAN0_INT3.
*/
#define	SRC_CANINT3	(SRC_CAN_CAN0_INT3)

/** \brief  910, MULTICAN Service Request */
#define SRC_CAN_CAN0_INT4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038910u)

/** Alias (User Manual Name) for SRC_CAN_CAN0_INT4.
* To use register names with standard convension, please use SRC_CAN_CAN0_INT4.
*/
#define	SRC_CANINT4	(SRC_CAN_CAN0_INT4)

/** \brief  914, MULTICAN Service Request */
#define SRC_CAN_CAN0_INT5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038914u)

/** Alias (User Manual Name) for SRC_CAN_CAN0_INT5.
* To use register names with standard convension, please use SRC_CAN_CAN0_INT5.
*/
#define	SRC_CANINT5	(SRC_CAN_CAN0_INT5)

/** \brief  918, MULTICAN Service Request */
#define SRC_CAN_CAN0_INT6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038918u)

/** Alias (User Manual Name) for SRC_CAN_CAN0_INT6.
* To use register names with standard convension, please use SRC_CAN_CAN0_INT6.
*/
#define	SRC_CANINT6	(SRC_CAN_CAN0_INT6)

/** \brief  91C, MULTICAN Service Request */
#define SRC_CAN_CAN0_INT7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003891Cu)

/** Alias (User Manual Name) for SRC_CAN_CAN0_INT7.
* To use register names with standard convension, please use SRC_CAN_CAN0_INT7.
*/
#define	SRC_CANINT7	(SRC_CAN_CAN0_INT7)

/** \brief  920, MULTICAN Service Request */
#define SRC_CAN_CAN0_INT8 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038920u)

/** Alias (User Manual Name) for SRC_CAN_CAN0_INT8.
* To use register names with standard convension, please use SRC_CAN_CAN0_INT8.
*/
#define	SRC_CANINT8	(SRC_CAN_CAN0_INT8)

/** \brief  924, MULTICAN Service Request */
#define SRC_CAN_CAN0_INT9 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038924u)

/** Alias (User Manual Name) for SRC_CAN_CAN0_INT9.
* To use register names with standard convension, please use SRC_CAN_CAN0_INT9.
*/
#define	SRC_CANINT9	(SRC_CAN_CAN0_INT9)

/** \brief  940, MULTICAN1 Service Request */
#define SRC_CAN_CAN10_INT0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038940u)

/** Alias (User Manual Name) for SRC_CAN_CAN10_INT0.
* To use register names with standard convension, please use SRC_CAN_CAN10_INT0.
*/
#define	SRC_CAN1INT0	(SRC_CAN_CAN10_INT0)

/** \brief  944, MULTICAN1 Service Request */
#define SRC_CAN_CAN10_INT1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038944u)

/** Alias (User Manual Name) for SRC_CAN_CAN10_INT1.
* To use register names with standard convension, please use SRC_CAN_CAN10_INT1.
*/
#define	SRC_CAN1INT1	(SRC_CAN_CAN10_INT1)

/** \brief  948, MULTICAN1 Service Request */
#define SRC_CAN_CAN10_INT2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038948u)

/** Alias (User Manual Name) for SRC_CAN_CAN10_INT2.
* To use register names with standard convension, please use SRC_CAN_CAN10_INT2.
*/
#define	SRC_CAN1INT2	(SRC_CAN_CAN10_INT2)

/** \brief  94C, MULTICAN1 Service Request */
#define SRC_CAN_CAN10_INT3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003894Cu)

/** Alias (User Manual Name) for SRC_CAN_CAN10_INT3.
* To use register names with standard convension, please use SRC_CAN_CAN10_INT3.
*/
#define	SRC_CAN1INT3	(SRC_CAN_CAN10_INT3)

/** \brief  950, MULTICAN1 Service Request */
#define SRC_CAN_CAN10_INT4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038950u)

/** Alias (User Manual Name) for SRC_CAN_CAN10_INT4.
* To use register names with standard convension, please use SRC_CAN_CAN10_INT4.
*/
#define	SRC_CAN1INT4	(SRC_CAN_CAN10_INT4)

/** \brief  954, MULTICAN1 Service Request */
#define SRC_CAN_CAN10_INT5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038954u)

/** Alias (User Manual Name) for SRC_CAN_CAN10_INT5.
* To use register names with standard convension, please use SRC_CAN_CAN10_INT5.
*/
#define	SRC_CAN1INT5	(SRC_CAN_CAN10_INT5)

/** \brief  958, MULTICAN1 Service Request */
#define SRC_CAN_CAN10_INT6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038958u)

/** Alias (User Manual Name) for SRC_CAN_CAN10_INT6.
* To use register names with standard convension, please use SRC_CAN_CAN10_INT6.
*/
#define	SRC_CAN1INT6	(SRC_CAN_CAN10_INT6)

/** \brief  95C, MULTICAN1 Service Request */
#define SRC_CAN_CAN10_INT7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003895Cu)

/** Alias (User Manual Name) for SRC_CAN_CAN10_INT7.
* To use register names with standard convension, please use SRC_CAN_CAN10_INT7.
*/
#define	SRC_CAN1INT7	(SRC_CAN_CAN10_INT7)

/** \brief  420, CCU6 Service Request 0 */
#define SRC_CCU6_CCU60_SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038420u)

/** Alias (User Manual Name) for SRC_CCU6_CCU60_SR0.
* To use register names with standard convension, please use SRC_CCU6_CCU60_SR0.
*/
#define	SRC_CCU60SR0	(SRC_CCU6_CCU60_SR0)

/** \brief  424, CCU6 Service Request 1 */
#define SRC_CCU6_CCU60_SR1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038424u)

/** Alias (User Manual Name) for SRC_CCU6_CCU60_SR1.
* To use register names with standard convension, please use SRC_CCU6_CCU60_SR1.
*/
#define	SRC_CCU60SR1	(SRC_CCU6_CCU60_SR1)

/** \brief  428, CCU6 Service Request 2 */
#define SRC_CCU6_CCU60_SR2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038428u)

/** Alias (User Manual Name) for SRC_CCU6_CCU60_SR2.
* To use register names with standard convension, please use SRC_CCU6_CCU60_SR2.
*/
#define	SRC_CCU60SR2	(SRC_CCU6_CCU60_SR2)

